<a href="https://colab.research.google.com/github/Kevoen/Google_Colab_Rep/blob/master/%E7%AC%AC%E4%BA%8C%E7%AB%A0%EF%BC%9A%E7%AC%AC%E4%B8%80%E8%8A%82%E6%95%B0%E6%8D%AE%E6%B8%85%E6%B4%97%E5%8F%8A%E7%89%B9%E5%BE%81%E5%A4%84%E7%90%86_%E8%AF%BE%E7%A8%8B.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 0. 连接与挂载Google Drive

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [2]:
!ln -s /content/drive/My\ Drive /mydrive

In [3]:
%cd /mydrive/Colab_Notebooks/DataWhela/Data Analysis/hands-on-data-analysis/第二章项目集合

/content/drive/My Drive/Colab_Notebooks/DataWhela/Data Analysis/hands-on-data-analysis/第二章项目集合

【回顾&引言】前面一章的内容大家可以感觉到我们主要是对基础知识做一个梳理，让大家了解数据分析的一些操作，主要做了数据的各个角度的观察。那么在这里，我们主要是做数据分析的流程性学习，主要是包括了数据清洗以及数据的特征处理，数据重构以及数据可视化。这些内容是为数据分析最后的建模和模型评价做一个铺垫。

#### 开始之前，导入numpy、pandas包和数据

In [4]:
#加载所需的库
import numpy as np
import pandas as pd

In [11]:
#加载数据train.csv
train = pd.read_csv('train.csv')

## 2 第二章：数据清洗及特征处理
我们拿到的数据通常是不干净的，所谓的不干净，就是数据中有缺失值，有一些异常点等，需要经过一定的处理才能继续做后面的分析或建模，所以拿到数据的第一步是进行数据清洗，本章我们将学习缺失值、重复值、字符串和数据转换等操作，将数据清洗成可以分析或建模的亚子。

### 2.1 缺失值观察与处理
我们拿到的数据经常会有很多缺失值，比如我们可以看到Cabin列存在NaN，那其他列还有没有缺失值，这些缺失值要怎么处理呢

#### 2.1.1 任务一：缺失值观察
(1) 请查看每个特征缺失值个数  
(2) 请查看Age， Cabin， Embarked列的数据
以上方式都有多种方式，所以大家多多益善

In [6]:
#写入代码
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [12]:
#写入代码
# train.isnull().sum()
train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
#写入代码
train[['Age','Cabin','Embarked']].head()

    Age Cabin Embarked
0  22.0   NaN        S
1  38.0   C85        C
2  26.0   NaN        S
3  35.0  C123        S
4  35.0   NaN        S

#### 2.1.2 任务二：对缺失值进行处理
(1)处理缺失值一般有几种思路

(2) 请尝试对Age列的数据的缺失值进行处理

(3) 请尝试使用不同的方法直接对整张表的缺失值进行处理

In [8]:
#处理缺失值的一般思路：
#提醒：可使用的函数有--->dropna函数与fillna函数
train[train.Age == None]=0  #无法实现
train.Age.isnull().sum()

177

In [9]:
#写入代码
# train[train.Age.isnull()]=0
train[train.Age.isna()]=0
train.Age.isnull().sum()

0

In [14]:
#写入代码
train[train.Age == np.nan]=0   #无法实现
train.Age.isnull().sum()

177

In [15]:
train[train.Age.isna()]=0
train.Age.isnull().sum()

0

In [ ]:
#写入代码
# train.dropna()

train.fillna(0,inplace=True)

【思考1】dropna和fillna有哪些参数，分别如何使用呢?

In [ ]:
df.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
df.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None)

【思考2】检索空缺值用np.nan要比用None好，这是为什么？

In [ ]:
#思考回答

【参考】https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html

【参考】https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html

### 2.2 重复值观察与处理
由于这样那样的原因，数据中会不会存在重复值呢，如果存在要怎样处理呢

#### 2.2.1 任务一：请查看数据中的重复值

In [ ]:
#写入代码
train[train.duplicated()]

     PassengerId  Survived  Pclass Name Sex  ...  Parch  Ticket  Fare Cabin  Embarked
17             0         0       0    0   0  ...      0       0   0.0     0         0
19             0         0       0    0   0  ...      0       0   0.0     0         0
26             0         0       0    0   0  ...      0       0   0.0     0         0
28             0         0       0    0   0  ...      0       0   0.0     0         0
29             0         0       0    0   0  ...      0       0   0.0     0         0
..           ...       ...     ...  ...  ..  ...    ...     ...   ...   ...       ...
859            0         0       0    0   0  ...      0       0   0.0     0         0
863            0         0       0    0   0  ...      0       0   0.0     0         0
868            0         0       0    0   0  ...      0       0   0.0     0         0
878            0         0       0    0   0  ...      0       0   0.0     0         0
888            0         0       0    0   0  ...      0       0   0.0     0         0

[176 rows x 12 columns]

#### 2.2.2 任务二：对重复值进行处理
(1)重复值有哪些处理方式呢？

(2)处理我们数据的重复值

方法多多益善

In [ ]:
#重复值有哪些处理方式：
train.drop_duplicates()

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[715 rows x 12 columns]

####  2.2.3 任务三：将前面清洗的数据保存为csv格式

In [ ]:
#写入代码
train.to_csv('train_clear.csv')

In [ ]:
train.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

### 2.3 特征观察与处理
我们对特征进行一下观察，可以把特征大概分为两大类：  
数值型特征：Survived ，Pclass， Age ，SibSp， Parch， Fare，其中Survived， Pclass为离散型数值特征，Age，SibSp， Parch， Fare为连续型数值特征  
文本型特征：Name， Sex， Cabin，Embarked， Ticket，其中Sex， Cabin， Embarked， Ticket为类别型文本特征，数值型特征一般可以直接用于模型的训练，但有时候为了模型的稳定性及鲁棒性会对连续变量进行离散化。文本型特征往往需要转换成数值型特征才能用于建模分析。

#### 2.3.1 任务一：对年龄进行分箱（离散化）处理
(1) 分箱操作是什么？

(2) 将连续变量Age平均分箱成5个年龄段，并分别用类别变量12345表示  

(3) 将连续变量Age划分为[0,5) [5,15) [15,30) [30,50) [50,80)五个年龄段，并分别用类别变量12345表示  

(4) 将连续变量Age按10% 30% 50 70% 90%五个年龄段，并用分类变量12345表示

(5) 将上面的获得的数据分别进行保存，保存为csv格式

In [ ]:
#分箱操作是什么：

In [18]:
#写入代码
train['AgeBand'] = pd.cut(train['Age'], 5,labels = ['1','2','3','4','5'])
train.head()

   PassengerId  Survived  Pclass  ... Embarked False  AgeBand
0            1         0       3  ...        S     0        2
1            2         1       1  ...        C     0        3
2            3         1       3  ...        S     0        2
3            4         1       1  ...        S     0        3
4            5         0       3  ...        S     0        3

[5 rows x 14 columns]

In [19]:
#写入代码
train['AgeBand'] = pd.cut(train['Age'],[0,5,15,30,50,80],labels= ['1','2','3','4','5'])
train.head()

   PassengerId  Survived  Pclass  ... Embarked False  AgeBand
0            1         0       3  ...        S     0        3
1            2         1       1  ...        C     0        4
2            3         1       3  ...        S     0        3
3            4         1       1  ...        S     0        4
4            5         0       3  ...        S     0        4

[5 rows x 14 columns]

In [ ]:
#写入代码
train['AgeBand'] = pd.qcut(train['Age'],[ 0., 0.1, 0.3, 0.5, 0.7, 0.9],labels= ['1','2','3','4','5'])
train.head()

【参考】https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.cut.html

【参考】https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.qcut.html

#### 2.3.2 任务二：对文本变量进行转换
(1) 查看文本变量名及种类  
(2) 将文本变量Sex， Cabin ，Embarked用数值变量12345表示  
(3) 将文本变量Sex， Cabin， Embarked用one-hot编码表示

In [28]:
#写入代码
train.Sex.value_counts()

male      453
female    261
0         177
Name: Sex, dtype: int64

In [29]:
train.Cabin.value_counts()

0              177
G6               4
B96 B98          4
C23 C25 C27      4
F2               3
              ...
A20              1
B30              1
B71              1
D7               1
C104             1
Name: Cabin, Length: 135, dtype: int64

In [30]:
train.Embarked.value_counts()

S    554
0    177
C    130
Q     28
Name: Embarked, dtype: int64

In [31]:
train.Sex.unique()

array(['male', 'female', 0], dtype=object)

In [32]:
train.Sex.nunique()

3

In [ ]:
#写入代码
train['sex_num'] = train['Sex'].replace(['male','female'],[1,2])
train.head()

In [ ]:
#写入代码
train['sex_num'] = train['Sex'].map('male': 1, 'female': 2)
train.head()

In [ ]:
#方法三: 使用sklearn.preprocessing的LabelEncoder
from sklearn.preprocessing import LabelEncoder
for feat in ['Cabin', 'Ticket']:
    lbl = LabelEncoder()  
    label_dict = dict(zip(df[feat].unique(), range(df[feat].nunique())))
    df[feat + "_labelEncode"] = df[feat].map(label_dict)
    df[feat + "_labelEncode"] = lbl.fit_transform(df[feat].astype(str))

df.head()

#### 2.3.3 任务三：从纯文本Name特征里提取出Titles的特征(所谓的Titles就是Mr,Miss,Mrs等)

In [ ]:
#写入代码
df['Title'] = df.Name.str.extract('([A-Za-z]+)\.', expand=False)
df.head()

In [ ]:
#保存最终你完成的已经清理好的数据
df.to_csv('test_fin.csv')